---
kind: type
id: T:Autodesk.Revit.DB.ExternallyTaggedNonBReps
source: html/75aca564-2aa0-1695-d5c4-9aacf0cf5c16.htm
---
# Autodesk.Revit.DB.ExternallyTaggedNonBReps

Holds a collection of ExternallyTaggedNonBRep instances.

## Syntax (C#)
```csharp
public class ExternallyTaggedNonBReps : IDisposable
```